Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །བདག་ནི་དད་པས་རབ་བྱུང་ནས། །རྒྱལ་བའི་བསྟན་ལ་བརྩོན་བྱས་ཏེ།
en: “I went forth out of faith And exerted myself in the Victor’s teachings, But I was not able to achieve even concentration of mind,

source: །ལོ་ནི་ཉི་ཤུ་ལྔ་ལོན་ཡང་། །སེམས་མཉམ་པ་ཡང་མ་ཐོབ་བོ།
en: Even after twenty-five years.

source: །དེ་ནས་བདག་གི་སྡིག་པའི་སེམས།
en: “Then I entertained an evil thought

source: །འདོད་ལ་ཞེན་པ་སྐྱེས་པ་ནི།
en: Of attachment to the objects of desire:

source: །བདུད་རྩི་རྟོགས་པར་མ་གྱུར་གྱིས།
en: ‘I have not understood the nectar,

source: །དམན་པར་སླར་ནི་བདག་ལྡོག་སྙམ།
en: So I will return again to the lower life.’

source: །དེ་ནས་ངོ་ཚ་ཁྲེལ་ཡོད་པ།
en: “Then I felt shame, ignominy,

source: །དོན་ཆེན་དག་ནི་སྐྱེས་གྱུར་པ།
en: Which was of great benefit, and thought,

source: །བདག་ལ་ཉེ་དུའི་ཚོགས་སྨོད་ཅིང་།
en: ‘If my relatives reproach me

source: །སྐྱོན་དུ་ཡང་ནི་འགྲང་འགྱུར་བ།
en: And count me as a stain on them,

source: །དེ་ནི་བདག་དང་འཚམ་མིན་ཞིང་།
en: “ ‘That would not be suitable for me.

source: །དེ་ནི་བཟང་པོ་མ་ཡིན་གྱིས།
en: That would not be good.

source: །བདག་ལྟ་གསོན་ནའང་ཅི་རུ་རུང་།
en: Is there any reason for such a one like me to live?

source: །མཚོན་གྱིས་གདབ་པར་བྱའོ་སྙམ།
en: I will kill myself with a sword.’

source: །མཚོན་རྣོན་བདག་གིས་བླངས་ནས་སུ།
en: “I took a sharp sword

source: །སྐྱིལ་མོ་ཀྲུང་ནི་བཅས་ནས་ཀྱང་།
en: And sat down with my legs crossed.

source: །མཚོན་ནི་སྐེ་ལ་གཏད་པ་ལས།
en: When I put the blade against my neck,

source: །དེ་ནས་སེམས་ནི་རྣམ་པར་གྲོལ། །བདག་སེམས་ཐ་བ་ལས་གྲོལ་ནས།
en: Then my mind was emancipated. “Liberated from my rigid thoughts,

source: །ཡང་དང་ཡང་དུ་བརྗོད་པ་ནི།
en: I chanted again and again,

source: །ཨེ་མའོ་སངས་རྒྱས་ཆོས་དགེ་འདུན།
en: ‘O Buddha, O Dharma, O Saṅgha!

source: །ཨེ་མའོ་ཆོས་ཉིད་ཨེ་རེ་བཟང་།
en: O excellent nature of the Dharma!’

source: །སྔོན་ནི་བདག་གི་འདུ་ཤེས་གང་།
en: “Once, I conceived the thought

source: །སོ་སོའི་སྐྱེ་བོ་ཤི་བླ་སྙམ།
en: That it would be better that an ordinary person die.

source: །བདག་གིས་སྲོག་ལ་མ་བལྟས་པས།
en: Since I had relinquished my life,

source: །ཞི་བ་དམ་པ་ཐོབ་པར་གྱུར། །སྔོན་ནི་འཁུམས་པར་གྱུར་པ་ཡིས།
en: I attained the supreme tranquility. “Once, because of my narrow mind,

source: །དམ་ཆོས་སེར་སྣ་བྱས་པ་གང་།
en: I was stingy with the excellent Dharma.

source: །བཙུན་པ་དེ་ཡི་འབྲས་བུ་ནི།
en: O honored ones, the fruit of that was

source: །སྡུག་བསྔལ་བ་ཡིས་རྣམ་པར་གྲོལ།
en: Difficulty in being emancipated. “I did preach the excellent Dharma, though,

source: །བདག་གིས་འཆི་བའི་དུས་ན་ཆོས། །དམ་པ་རབ་བསྟན་གང་ཡིན་པའི།
en: At the time of my death.

source: །ཕུན་སུམ་ཚོགས་པའི་ཕ་རོལ་ཕྱིན།
en: I was endowed with perfection.”

source: །ཤཱཀྱའི་བུ་ཕོ་དབང་པོ་བརྟུལ།
en: Thus, the Śākyan of dull faculties,

source: །སྤྲུལ་ཁོལ་མཐུ་ཆེན་ལྡན་པས་ནི།
en: Sarpadāsa, who possessed great power,

source: །སྤྲུལ་ཁོལ་གྱི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་གཉིས་པའོ།། །།
en: Here ends the twenty-second section: The Section of Sarpadāsa. 3. Aniruddha

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Aniruddha, “O Venerable Aniruddha, the venerable Sarpadāsa has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ཚེ་དང་ལྡན་པ་སྤྲུལ་ཁོལ་གྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Aniruddha, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Aniruddha did explain his karmic bond:

source: སྔོན་ནི་ཕྲག་ཁུར་ཁྱེར་བ་ཡི། །རྩྭ་ཐུན་དབུལ་པོར་གྱུར་པ་ན།
en: “Once when I was a poor grass-cutter, Carrying a load on my shoulder,

source: །བདག་གིས་དགེ་སྦྱོང་གྲགས་ལྡན་པ།
en: I offered almsfood to a renowned śramaṇa,

source: །ཉོན་མོངས་བཅོམ་ལ་བསོད་སྙོམས་ཕུལ།
en: Who had destroyed his defilements.

source: །ཤཱཀྱའི་རིགས་ལ་བདག་སྐྱེས་ནའང་།
en: “Born into the family of the Śākyans,

source: །བདག་ནི་མ་འགགས་ཡིན་པར་ཤེས།
en: I was known to be unobstructed (aniruddha).

source: །རོལ་མོ་གླུ་ལ་མཁས་གྱུར་པས།
en: I was skilled in music and singing

source: །ཕེག་སྒྲ་ཕྱད་པས་བསླང་བ་ན།
en: And constantly heard the sound of cymbals.

source: །རྫོགས་སངས་ག་ལས་བསྙེངས་མེད་པ།
en: “I saw the Completely Awakened One,

source: །སྟོན་པ་བདག་གིས་མཐོང་བར་གྱུར།
en: The Teacher, who is not afraid of anything.

source: །མཐོང་ནས་བདག་ནི་སེམས་དད་པས།
en: When I saw him, with my mind filled with faith,

source: །ཁྱིམ་མེད་པར་ཡང་རབ་ཏུ་བྱུང་།
en: I went forth into homelessness.

source: །བདག་གིས་དེ་ཡི་གསུང་ཐོས་ནས།
en: “Having heard his words,

source: །བསྟན་ལ་དགའ་བས་གནས་གྱུར་ཏེ།
en: I dwelled with delight in the teaching,

source: །རྟག་ཏུ་ཕ་རོལ་གནོན་བརྟན་ཞིང་།
en: Always relying upon the vanquisher of enemies,

source: །གཟབས་པའི་བདག་ཉིད་བརྩོན་འགྲུས་བརྩམས།
en: And I heedfully exerted myself.

source: །སངས་རྒྱས་བསྟན་པ་མཐར་ཕྱུང་ནས།
en: “I accomplished what the Buddha had taught

source: །རིག་པ་གསུམ་ནི་རྗེས་སུ་ཐོབ།
en: And attained the threefold knowledge. I came to know my former lives,

source: །བདག་སྔོན་གང་ན་འདུག་པ་ཡི། །སྔོན་གྱི་གནས་ནི་ཤེས་གྱུར་ཏེ།
en: Where I had once been. “I was born seven times

source: །སུམ་བཅུ་རྩ་གསུམ་ལྷ་རྣམས་སུ། །བདག་གིས་ལན་བདུན་སྐྱེ་བ་བླངས།
en: Among the Thirty-Three Gods.

source: །སླར་ཡང་མི་ཡི་ནང་དུ་ནི།
en: Also, among humans,

source: །མི་ཡི་དབང་པོ་ལན་བདུན་བྱས།
en: Seven times I was the people’s master.

source: །དེ་ཚེ་འཛམ་ཚལ་དབང་ཕྱུག་གི།
en: “Then I was anointed as a kṣatriya

source: །རྒྱལ་རིགས་སྤྱི་བོར་དབང་བསྐུར་ཏོ།
en: Ruling the continent of Jambu.

source: །འདིར་ནི་བདུན་དང་དེར་བདུན་ཏེ།
en: Seven times here, seven times there—

source: །བདག་གིས་ལན་ནི་བཅུ་བཞིར་འཁོར།
en: I was thus reborn fourteen times. I came to know my former lives,

source: །བདག་སྔོན་གང་ན་འདུག་པ་ཡི། །གནས་ནི་སྔོན་དུ་ཤེས་གྱུར་ཏེ།
en: Where I had once been. “At that time, I enjoyed

source: །ལས་ཀྱི་འབྲས་བུ་དེ་ལྟ་བུ། །བདག་གིས་དེ་ཚེ་ཉམས་སུ་མྱོང་།
en: The fruit of such karma.

source: །དགའ་བ་དག་གིས་རྒྱུ་བར་བྱེད།
en: I lived amid pleasure.

source: །སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་དང་། །འོང་བ་དང་ནི་འགྲོ་བ་དང་། །འདི་ལྟ་བུ་དང་གཞན་གྱུར་ཤེས། །འཕགས་པའི་ཡན་ལག་ལྔ་ལྡན་དགའ།
en: “I realized how beings die, How they come and go, How they become thus and otherwise, And the joy of the noble ones’ five-factored meditation. “Directing my attention tranquilly and devotedly

source: །ཡན་ལག་ལྔ་པའི་ཏིང་འཛིན་ལ། །ཞི་བ་ཕྱོགས་གཅིག་གོམས་བྱས་ཤིང་། །ཤིན་ཏུ་སྦྱངས་ཐོབ་ལམ་གྱིས་ནི།
en: To the meditation consisting of five factors,

source: །ལྷ་ཡི་སྤྱན་ནི་རྣམ་པར་སྦྱངས།
en: I purified my divine sight Through the fully purified path.

source: །སྟོན་པ་འཇིག་རྟེན་བླ་མེད་ཀྱིས། །བདག་གི་ཀུན་རྟོག་མཁྱེན་ནས་ཀྱང་། །ཡིད་ལས་བྱུང་བའི་སྐུ་ཡིས་ནི།
en: “Knowing my mind, The Teacher, who was the highest in the world,

source: །བདག་དྲུང་རྫུ་འཕྲུལ་གྱིས་བྱོན་ནས།
en: Came to me by his magical power, Manifesting in his spiritual body.

source: །སྟོན་པ་སྤྲོས་མེད་ལ་དགྱེས་པས།
en: “The Teacher, who rejoices at freedom from conceptual proliferation,

source: །སྤྲོས་པ་དང་ནི་བྲལ་བ་བཤད།
en: Taught me how to be rid of conceptual proliferation.

source: །རྟག་པར་ཕ་རོལ་གནོན་བརྟན་ཞིང་།
en: “Always relying upon the vanquisher of enemies,

source: །སངས་རྒྱས་བསྟན་ལ་མཐར་ཕྱུང་ནས།
en: I accomplished what the Buddha taught

source: །འཆི་བའང་མངོན་པར་མི་དགའ་ཞིང་།
en: “Not rejoicing at death,

source: །འཚོ་བའང་མངོན་པར་མི་དགའ་སྟེ།
en: Not rejoicing at life,

source: །ཤེས་བཞིན་དྲན་དང་ལྡན་པ་ཡིས།
en: Possessing intelligence and recollection,

source: །དུས་ལ་སོ་སོར་རྟོག་པར་བྱེད།
en: At the appropriate time, I engage in observation. “In the bamboo thicket

source: །ཡངས་པའི་འོད་མའི་གྲོང་ཁྱེར་གྱི། །འོད་མའི་ཚང་ཚིང་དེའི་དྲུང་དུ།
en: In the village of Beluva,

source: །བདག་གི་སྲོག་ནི་ཟད་ནས་ཀྱང་།
en: After my life is exhausted,

source: །ཟག་མེད་མྱ་ངན་འདའ་བར་འགྱུར།
en: I will be emancipated as an untainted one.

source: །བདག་གིས་བསོད་སྙོམས་བྱིན་པས་ནི། །འབྲས་བུ་ཐོབ་པ་འདི་ཡིན་ཏེ།
en: “This is the fruit I gained By giving almsfood.

source: །རྫོགས་སངས་གང་ཟག་ཟླ་མེད་པའི།
en: I have pleased the Completely Awakened One,

source: །སྟོན་པ་བདག་གིས་མཉེས་པར་བྱས།
en: The matchless man, the Teacher.

source: །ཐམས་ཅད་གཟིགས་པས་བསོད་ནམས་ཅན། །རྣམས་ཀྱི་མཆོག་ཏུ་བདག་བསྟན་ཏོ།
en: The All-Seeing One has praised me As the best of those who are endowed with merit.”

source: །དེ་ལྟར་གནས་བརྟན་མ་འགགས་པས།
en: Thus the Elder Aniruddha Explained his karma,

source: །མ་འགགས་པའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་གསུམ་པའོ།། །།
en: Here ends the twenty-third section: The Section of Aniruddha. 4. Kāla

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་རི་དགས་འཛིན་གྱི་བུ་ནག་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Kāla Mṛgāraputra, “O Venerable Kāla, the venerable Aniruddha has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་ནག་པོ་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable One, should also explain your karmic bond.”

source: །ཚེ་དང་ལྡན་པས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་རི་དགས་འཛིན་གྱི་བུ་ནག་པོས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་བར་བྱེད་དེ།
en: Then the venerable Kāla Mṛgāraputra did explain his karmic bond: “When I was squeezing sugarcane

source: བུ་རམ་སྦྱོར་བའི་ཁང་པ་ན། །བུ་རམ་ཤིང་རྣམས་འཚིར་བ་ལས།
en: In a guḍa-making hut,

source: །ནད་པ་གསོར་རུང་ཞིག་འོངས་ནས།
en: Came in, sick and in need of a remedy. “I offered guḍa and oil

source: །བདག་གིས་ཐུབ་པ་ནུབ་བདུན་དུ། །བུ་རམ་ཏིལ་མར་བསྙེན་བཀུར་བྱས།
en: To the Muni for seven nights.

source: །སྐལ་ལྡན་ཞག་བདུན་འདས་པ་དང་། །དེ་ནས་དེ་ནི་མཁའ་ལ་འཕགས།
en: The fortunate one, when seven days had passed, Soared up into the air.

source: །དེ་ནས་བྲན་དེ་ཉེར་འོངས་ནས།
en: “After that, a slave who had served him

source: །བདག་ལ་སྨྲས་པར་གྱུར་པ་ནི།
en: Said to me,

source: །ཡོན་གནས་རབ་ཏུ་བྱུང་གྱུར་པ།
en: ‘That mendicant worthy of veneration

source: །དེ་ལྟ་བུ་ནི་སོང་བར་གྱུར།
en: Has left.’

source: །དྲང་སྲོང་མཁའ་ལ་སོང་ངོ་ཞེས། །བདག་གིས་དེ་ལས་ཚིག་ཐོས་ནས།
en: “When I heard from him That the ṛṣi had left through the air,

source: །སེམས་མགུ་བ་དང་ཡིད་བདེ་བས།
en: I was delighted and satisfied

source: །དེ་ཡི་ཚེ་ན་དད་པ་བྱས།
en: And then acquired faith.

source: །སེམས་རབ་དང་བ་དེ་དང་ནི།
en: “Because of that pure mind

source: །བུ་རམ་སྦྱིན་པར་བཏང་བ་དེས།
en: And that guḍa given,

source: །ཤཱཀྱ་སེང་གེའི་བསྟན་པ་ལ། །བདག་གིས་རབ་འབྱུང་ཐོབ་ནས་ནི།
en: In the teachings of the Lion of the Śākyans,

source: །ད་དུང་དུ་ཡང་བཙུན་པ་དག །བདག་གི་ཆོས་གོས་བསོད་སྙོམས་དང་། །ཡོ་བྱད་དང་ནི་གནས་མལ་གྱི།
en: “Still now, O honored ones, I have obtained many benefits, Such as robes, almsfood,

source: །རྙེད་པ་མང་པོ་སྐྱེ་བར་གྱུར།
en: Requisites, and bedding and a seat.

source: །བདག་ནི་ཆོས་གོས་འདྲུབ་པ་ན། །བུ་རམ་བཏུང་བ་བླུད་པའི་ཕྱིར།
en: “When I had my robes sewn,

source: །བདག་ལ་བུ་རམ་སྣོད་བཞི་ཞིག །དགོས་སོ་སྙམ་དུ་བསམས་པ་དང་། །རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ལ།
en: I thought I needed Four vessels of guḍa To serve some guḍa drink.

source: །དེ་ནས་ལྷ་ཡིས་སྨྲས་པ་ནི།
en: “Then a god advised

source: །རི་དགས་འཛིན་བུ་ནག་པོ་ལ།
en: King Bimbisāra,

source: །བུ་རམ་བཏུང་བ་བྱིན་ཅིག་དང་། །མི་ཡི་དབང་པོ་ཁྱོད་ཀྱིས་ནི།
en: ‘Give some guḍa drink To Kāla Mṛgāraputra. “ ‘O master of humans, your giving the guḍa drink

source: །བུ་རམ་བཏུང་བ་དོན་ཆེན་འགྱུར།
en: Will cause great merit. Send guḍa to Mṛgāraputra

source: །འཚོ་བྱེད་ཨ་མྲའི་ཚལ་དུ་ནི།
en: In the mango grove of Jīvaka!’

source: །རི་དགས་བུ་ལ་བུ་རམ་སྐྱོལ།
en: “Bimbisāra, the best of kings,

source: །རྒྱལ་པོའི་མཆོག་ནི་མཐུ་ཆེན་པོ། །གཟུགས་ཅན་སྙིང་པོས་བདག་ལ་ནི།
en: Who possessed great power,

source: །སྣོད་ཆེན་བུ་རམ་གྱིས་བཀང་བ། །བཞི་པོ་དག་ནི་བསྐུར་བར་གྱུར།
en: Offered me four large vessels Filled with guḍa.

source: །དེ་ནས་དེས་ནི་བུ་རམ་དག །རོ་དང་ལྡན་པ་ཁྱེར་འོངས་ནས།
en: “Then, after delicious guḍa Was brought by him,

source: །སྟོང་ནི་ཉིས་བརྒྱ་ལྔ་བཅུ་ཡི། །དགེ་སློང་དགེ་འདུན་ཚིམ་པར་བྱས། །རི་དགས་འཛིན་བུ་དགྲ་བཅོམ་པ། །མངོན་ཤེས་དྲུག་ལྡན་མཐུ་ཆེན་པོ།
en: The community of one thousand two hundred and fifty monks Was satisfied.” Thus Mṛgāraputra, who was an arhat Possessing the six kinds of supernormal knowledge and great power,

source: །རི་དགས་འཛིན་གྱི་བུ་ནག་པོའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་བཞི་པའོ།། །།
en: Here ends the twenty-fourth section: The Section of Kāla Mṛgāraputra. 5. Rāhula

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་སྒྲ་ཅན་ཟིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Rāhula, “O Venerable Rāhula, the venerable Kāla Mṛgāraputra has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་སྒྲ་ཅན་ཟིན་ཚེ་དང་ལྡན་པ་རི་དགས་འཛིན་གྱི་བུ་ནག་པོས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Rāhula, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་སྒྲ་ཅན་ཟིན་གྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་སྒྲ་ཅན་ཟིན་གྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Rāhula did explain his karmic bond:

source: བདག་སྔོན་ལུས་འཕགས་མི་ཐི་ལའི།
en: “I was once the monarch,

source: །བདག་པོ་རྒྱལ་པོར་གྱུར་པ་ན།
en: The king of Mithilā in Videha.

source: །དགོས་པ་ཞིག་གི་ཕྱིར་འདུག་ནས།
en: When I was sitting for some business

source: །སྐྱེ་བོ་རྗེས་སུ་བསྟན་པ་ན།
en: And giving orders to my retainers,

source: །དེ་ནས་དྲང་སྲོང་དཀའ་ཐུབ་ཆེ།
en: “A ṛṣi engaged in great ascetic practice,

source: །གཟི་བརྗིད་མཆོག་འཇིགས་འོངས་གྱུར་ཏེ།
en: Who had a terrifying splendor, arrived.

source: །དེ་ནི་ཉེ་བར་འོངས་ནས་ཀྱང་། །བདག་ལ་འདི་སྐད་ཚིག་སྨྲས་སོ།
en: He approached me And spoke these words:

source: །ས་བདག་བདག་ནི་རྐུན་མ་སྟེ།
en: “ ‘O master of the earth, I am a thief,

source: །བདག་གིས་མ་བྱིན་ཆབ་འཚལ་གྱིས།
en: For I have drunk some water that was not given to me. May you impose a penalty,

source: །རྐུན་པོའི་ཆད་པ་ཇི་ལྟ་བར།
en: The same as you would on a thief.’

source: །ཁྱོད་ཀྱིས་དེ་བཞིན་གཅད་དུ་གསོལ།
en: “I replied to the ṛṣi,

source: །དྲང་སྲོང་ཆོས་ཀྱི་ཡོན་ཏན་དགའ། །དེ་ལ་བདག་གིས་དེར་སྨྲས་པ།
en: Who delighted in the good quality of the Dharma,

source: །ཁྱོད་ལ་ཆུ་ནི་གནང་བར་བྱས།
en: ‘The water is allowed to you.

source: །ཁྱོད་ནི་སོང་ལ་ཅི་བདེར་སྤྱོད།
en: Go and enjoy it.’

source: །རྒྱལ་པོ་བདག་གི་འགྱོད་པ་ནི།
en: “ ‘O King, my regret Cannot be removed by such a thing.

source: །དེ་ལྟས་བསལ་བའི་རྔོ་མི་ཐོག །བདག་ལ་ཆད་པས་གཅོད་མཛོད་དང་། །འགྱོད་པ་དག་དང་འབྲལ་བར་འགྱུར།
en: Impose a penalty on me, And I will be free from doubts.’

source: །བདག་གིས་དེ་ནི་སྐྱེད་མོས་ཚལ།
en: “I banished him

source: །གཞིར་ནི་ཞག་དྲུག་སྤང་བ་བྱས།
en: To a park for six days.

source: །དེ་ནི་ཞག་དྲུག་ལོན་ནས་ཕྱིར།
en: After six days had passed,

source: །རང་གི་བསྟི་གནས་གནས་སུ་སོང་། །ཞེ་སྡང་མེད་པའི་སེམས་ཀྱིས་ནི།
en: He left for his hermitage.

source: །སྡིག་པ་བདག་གིས་བྱས་པས་ཀྱང་།
en: “Since I had committed a sin, Though not out of anger,

source: །རབ་ཏུ་ཚ་དང་ཐིག་ནག་ཏུ། །ལོ་ནི་དྲུག་བཅུ་རྣམས་སུ་བཙོས།
en: I was boiled for sixty years In the Intense Heat and Black Cord Hells.

source: །མ་ཡི་མངལ་དུ་ལོ་དྲུག་ནི། །ཚང་བར་ཡང་ནི་འདུག་པར་གྱུར།
en: I stayed in my mother’s womb For six years.

source: །བདག་ནི་ཞེ་སྡང་མེད་བཞིན་དུ།
en: “Without anger,

source: །ལུས་དང་ངག་གི་ལས་བྱས་པ། །ལས་རྣམས་ཆུད་མི་ཟ་བས་ན།
en: I created karma of body and speech.

source: །དེ་ལྟར་གནས་བརྟན་སྒྲ་ཅན་ཟིན།
en: Thus the Elder Rāhula Explained his karma,

source: །སྒྲ་ཅན་ཟིན་གྱི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་ལྔ་པའོ།། །།
en: Here ends the twenty-fifth section: The Section of Rāhula. 6. Nanda

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Nanda, “O Venerable Nanda, the venerable Rāhula has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་དགའ་བོ་ཚེ་དང་ལྡན་པ་སྒྲ་ཅན་ཟིན་གྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Nanda, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་དགའ་བོས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོས་ཀྱང་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Nanda did explain his karmic bond:

source: རྣམ་པར་གཟིགས་ཀྱི་གསུང་རབ་ལ།
en: “In Vipaśyin’s dispensation,

source: །བདག་གིས་ལན་གཅིག་ཁྲུས་བྱས་ཏེ།
en: I once offered a bath.

source: །དགེ་སློང་དགེ་འདུན་ཁྲུས་བྱས་ནས།
en: After the community of monks had bathed,

source: །གནས་བརྟན་འདི་ལྟ་བུ་དག་དང་། །བདག་ནི་ལྷན་ཅིག་འགྲོགས་པར་ཤོག །དག་ཅིང་དྲི་མ་མེད་པ་དང་། །ཉོན་མོངས་མེད་ཅིང་ཟག་བྲལ་ཤོག །
en: “ ‘May I always be in the company Of elders equal to them. May I be clean, taintless, Free from defilements, and rid of impurities.

source: ཁ་དོག་བཟང་པོ་དག་དང་ནི།
en: “ ‘May I have a fine-colored face

source: །གཟུགས་བཟང་གྱུར་ཅེས་སྨོན་ལམ་བཏབ།
en: And an excellent appearance!’

source: །ལྷ་རྣམས་སུ་ནི་སྐྱེས་པར་གྱུར།
en: I was born among the gods. “I was born among humans and gods

source: །བདག་ནི་གསེར་གྱི་མདོག་འདྲ་བའི། །མི་དང་ལྷ་ནི་རྣམས་སུ་གྱུར།
en: Who were golden in complexion.

source: །ལོངས་སྤྱོད་ཆེན་པོས་ཤིན་ཏུ་གནས།
en: I lived with many possessions.

source: །རང་སངས་རྒྱས་ཀྱི་མཆོད་རྟེན་ནི། །ཤིན་ཏུ་དཀར་པོ་བདག་གིས་བརྩིགས།
en: “I built a pure white stūpa For a self-awakened one.

source: །དེ་ནས་བྱུག་པས་ཐམས་ཅད་ནི།
en: Then I anointed it with ointment

source: །སེར་པོར་གྱུར་པ་དེ་ལྟར་བྱུགས།
en: So that it became entirely yellow.

source: །དེ་ནས་མཚན་རྣམས་འདོད་པའི་ཕྱིར།
en: “Thereupon, desiring the auspicious marks, I made a wish

source: །གསེར་གྱི་མདོག་ཏུ་འགྱུར་བ་དང་། །གཟུགས་བཟང་དབྱིབས་ནི་ལེགས་འགྱུར་བར། །སྨོན་ལམ་དུ་ནི་གདབ་པ་བྱས།
en: For golden-colored skin, A beautiful figure, and excellent appearance.

source: །གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱིར་ནི།
en: I was born in the city of Vārāṇasī

source: །ཀ་ཤིའི་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ཡི། །བུ་ཕོ་འབྲིང་པོར་བདག་སྐྱེས་སོ།
en: As the middle son of Kṛkin, The king of Kāśi.

source: །འོད་སྲུང་མཆོད་རྟེན་མཐོང་ནས་ནི།
en: “When I saw the stūpa of Kāśyapa,

source: །དེ་ནས་དད་པའི་སེམས་བསྐྱེད་དེ། །མཆོད་རྟེན་དེ་ལ་བདག་གིས་ནི། །གདུགས་འབྲིང་ཞིག་ནི་གདགས་པ་བྱས།
en: It increased my faith. I had a middle-sized parasol Set on the stūpa.

source: །ཁྲུས་དེ་དང་ནི་བསྲོ་གང་དང་། །ཡུང་གི་བྱུག་པས་བྱུགས་པ་དང་། །གདུགས་ནི་གདགས་པ་བྱས་པ་ཡིས།
en: “Because of the bathing, the steam bath, Anointing with turmeric, And having the parasol set,

source: །བདག་གི་ཡང་སྲིད་ཐ་མ་འདིར།
en: In this final existence of mine

source: །ཤཱཀྱའི་རྒྱལ་པོའི་རིགས་སྐྱེས་ནས།
en: I was born into the Śākyan royal family

source: །སངས་རྒྱས་སྐྱོབ་པའི་མཆེད་དུ་གྱུར།
en: And became the brother of the Buddha, the Protector. “The marks of a great man

source: །བདག་གི་ལུས་ནི་འདི་ལ་ཡང་། །སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཡོད་པ།
en: On this body of mine

source: །སུམ་བཅུ་ལྷག་པ་མ་ཡིན་པའི།
en: Are no more than thirty,

source: །སུམ་བཅུ་དམན་པ་མ་ཡིན་པའོ།
en: And no less than thirty. “Having succeeded in going forth

source: །ཐམས་ཅད་གཟིགས་པས་མཛེས་པ་ཡི། །རྣམས་ཀྱི་མཆོག་ཏུ་བདག་བསྟན་ཏོ།
en: “The All-Seeing One has praised me As the best of those who are beautiful.

source: །ཉེས་བསལ་ཟག་པ་ཟད་ནས་ནི།
en: Having removed sin and exhausted impurities,

source: །གོ་འཕང་དམ་པ་ཐོབ་པར་གྱུར།
en: I attained the foremost state.”

source: །དེ་ལྟར་གནས་བརྟན་དགའ་བོས་ནི།
en: Thus the Elder Nanda Explained his karma,

source: །དགའ་བོའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་དྲུག་པའོ།། །།
en: Here ends the twenty-sixth section: The Section of Nanda. 7. Dravya

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་གྱད་བུ་ནོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གྱད་བུ་ནོར་ཚེ་དང་ལྡན་པ་དགའ་བོས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Dravya Mallaputra, “O Venerable Dravya Mallaputra, the venerable Nanda has explained his karmic bond.

source: ཚེ་དང་ལྡན་པ་གྱད་བུ་ནོར་གྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་གྱད་བུ་ནོར་གྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Now you, Venerable Dravya Mallaputra, should also explain your karmic bond.” Then the venerable Dravya Mallaputra did explain his karmic bond:

source: འདི་ནི་བདག་སྔོན་ཚོང་པ་ནི།
en: “I was once a merchant

source: །ཉ་པ་ཞེས་ནི་བྱ་བར་གྱུར། །ཚོང་པའི་ལམ་དུ་ཞུགས་པ་ན།
en: Named Fisherman. When I traveled for business, I fell in with a ṛṣi, “An untainted self-awakened one,

source: །དབང་དུ་གྱུར་ཅིང་ཟག་མེད་པ། །ཉོན་མོངས་མེད་པའི་རང་སངས་རྒྱས། །དྲང་སྲོང་ཞིག་ནི་འགྲོན་པར་འོངས། །དེ་ཡི་བར་དུ་བདག་གིས་ནི།
en: Who had attained power and was free from defilements.

source: །རྟག་པར་ཟས་ལ་མགྲོན་དུ་བོས།
en: I always invited him for meals During our travels.

source: །གང་དུ་བྲང་ནི་འདེབས་འགྱུར་བ།
en: “In each place we stayed,

source: །དེར་ནི་གདིང་བ་དག་ཀྱང་བཤམས།
en: I spread out carpets

source: །རྐང་པའི་ཆུ་དང་ཏིལ་མར་དང་། །དེ་ཡི་མར་མེ་དག་ཀྱང་བཤམས།
en: And set out water for washing feet, oil, And a lamp.

source: །ཇི་སྲིད་ལམ་ཡོད་དེ་སྲིད་དུ།
en: “During our travels,

source: །བདག་གིས་དེ་ལ་བཀུར་སྟི་བྱས།
en: I served him.

source: །ཚོང་པ་རྣམས་ཀྱིས་རིམ་བཞིན་དུ།
en: In due course, the merchants

source: །རྒྱ་མཚོའི་འགྲམ་དུ་ཕྱིན་པ་དང་། །དགེ་སློང་གྲུ་དྲུང་ཉེར་འོངས་ནས།
en: Arrived at the seashore. “The monk approached a ship,

source: །བདག་གིས་དེ་ལ་སྨྲས་པ་ནི།
en: And then I asked him,

source: །བཙུན་པ་རྒྱ་མཚོ་འདི་ལ་ནི།
en: ‘O honored one, why will you go to sea,

source: །ནོར་གྱི་སླད་དུ་བཞུད་དམ་ཅི།
en: Seeking treasure?

source: །བཙུན་པ་བདག་ཅག་ཕོངས་པས་ན།
en: “ ‘O honored one, we, the poor,

source: །འདོད་པ་དག་གི་ཕྱིར་ཡང་ནི།
en: Seeking the objects of desire,

source: །རྒྱ་མཚོ་ཆེན་པོའི་ཆུ་ཚོགས་ལ།
en: Take to the great ocean

source: །ཉེན་ཅན་དུ་ནི་འཇུག་པར་བྱེད།
en: In spite of the danger.’

source: །བདག་ལ་དགེ་སློང་དེས་སྨྲས་པ།
en: “The monk said to me,

source: །བདག་ནི་མྱ་ངན་འདས་པ་ཡིན།
en: ‘I have been emancipated.

source: །ཁྱེད་ཅག་གཉེན་ཀུན་ལྷན་ཅིག་ཏུ།
en: May you together with your relatives

source: །ནོར་ཆེར་བསོད་ནམས་ཆེ་བདེར་གྱུར།
en: Have great wealth and merit and become happy!’

source: །དེ་ཚེ་དེ་ལ་བདག་གིས་ནི།
en: “Then, with joy, I gave him

source: །རབ་དགའས་ཆོས་གོས་བཟང་པོ་ཕུལ།
en: A beautiful robe.

source: །མགོ་བོས་ཕྱག་ནི་བྱས་ནས་ཡང་།
en: Having bowed down,

source: །དེ་ལ་བསྐོར་བ་དག་བྱས་སོ།
en: I circumambulated him.

source: །དེས་ནི་ཆོས་གོས་བླངས་ནས་ནི། །དེ་དག་ཐམས་ཅད་ལྟ་བཞིན་དུ།
en: He then accepted the robe.

source: །དེ་ཡི་འོག་ཏུ་མཁའ་ལ་འཕགས།
en: Thereupon he soared up into the air

source: །ཆོ་འཕྲུལ་བྱེད་པ་དེ་མཐོང་ནས།
en: While all the merchants were watching him. “Having seen this miracle performed,

source: །དེ་ཚེ་བདག་ནི་སྐྱོ་གྱུར་ནས།
en: And then, sorrowful,

source: །བདག་གིས་ཐལ་མོ་སྦྱར་བྱས་ཏེ།
en: Making the gesture of supplication,

source: །དེ་ནས་སྨོན་ལམ་བཏབ་པ་ནི།
en: I made an aspiration:

source: །གནས་བརྟན་འདི་ལྟ་བུ་དག་དང་། །བདག་ནི་ལྷན་ཅིག་འགྲོགས་པར་ཤོག །འདི་ཡིས་ཆོས་ནི་གང་དག་ཐོབ།
en: “ ‘May I always be in the company Of elders equal to him! May I attain the qualities

source: །དེ་དག་བདག་གིས་ཐོབ་པར་ཤོག །རྫོགས་སངས་རྒྱས་ནི་མཉེས་བྱེད་ཅིང་།
en: That he has attained! “ ‘May I, pleasing a Completely Awakened One,

source: །རབ་ཏུ་འབྱུང་བ་ཐོབ་པ་དང་། །དགེ་འདུན་ལ་ཡང་རྫུ་འཕྲུལ་གྱིས།
en: Succeed in going forth, And serve the community By my magical power and miracles!’

source: །རྣམ་འཕྲུལ་བཀུར་སྟི་བྱེད་པར་ཤོག །དགེ་བའི་རྩ་བ་དེ་ཡིས་ནི།
en: “By this root of merit,

source: །ལྷ་ཡི་འཇིག་རྟེན་རབ་ཏུ་དགའ།
en: I enjoyed the world of the gods.

source: །མི་ཡི་འཐོབ་པ་ཐོབ་ནས་ཀྱང་།
en: When I obtained a human life,

source: །བདག་ནི་ནོར་ཆེན་ཕྱུག་པ་དང་། །བསོད་ནམས་བྱས་པས་མཛེས་པ་ཡི།
en: I was fabulously wealthy. Having made merit,

source: །བསྐལ་པ་ཐ་མ་འདི་ལ་ནི།
en: “In this final eon,

source: །སྲིད་པ་ཐ་མ་འདི་ལ་ཡང་། །ཀུ་ཤི་ཞེས་བྱའི་གྱད་རྣམས་ཀྱི།
en: In my final existence,

source: །གྱད་ཀྱི་བུར་ནི་བདག་སྐྱེས་ཏེ།
en: I was born as Mallaputra Among the Mallas in Kuśinagarī.

source: །བལྟ་ན་སྡུག་ཅིང་མཛེས་པ་དང་། །གཟུགས་བཟང་སྤྱོད་པ་མཛེས་པ་དང་། །ཐམས་ཅད་ལ་སྡུག་ཡིད་འོང་ཞིང་།
en: “Pleasant to behold, attractive, And well proportioned, well behaved, Lovable, and pleasing to everyone,

source: །ཕུན་སུམ་ཚོགས་པ་མཐར་ཕྱིན་ནོ།
en: I was blessed with perfection. “I pleased the Buddha,

source: །སངས་རྒྱས་ཤཱཀྱ་སེང་གེ་ནི། །བླ་ན་མེད་པ་མཉེས་པར་བྱས།
en: Lion of the Śākyans, the Supreme One.
